
var error_string = [
    [  0, 'OK'], 
    [  1, 'OK，但有警告信息'], 
    [  2, '部分错误'], 
    [  3, '跳过'], 
    [  4, '不支持的动作'], 
    [  5, '无效参数值'], 
    [  6, '不存在指定项'], 
    [  7, '不允许的操作'], 
    [  8, '指定项已经存在'], 
    [  9, '操作被取消'], 
    [ 10, '操作正在进行'], 
    [ 11, '存在多项'], 
    [ 12, '内存不足'], 
    [ 13, '输入输出忙'], 
    [ 14, '操作超时'], 
    [ 15, '未准备好'], 
    [ 16, '操作太过频繁'], 
    [ 17, '数据不完整'], 
    [ 99, '未知错误'], 

    [100, '通讯错误'], 
    [101, '无法连接'], 
    [102, '连接中断'], 
    [103, '服务器响应超时'], 
    [110, '通讯错误'], 

    [110, '报文错误'], 
    [111, '请求类型未知'], 
    [112, '缺少必要参数'], 

    [120, '文件系统错误'], 
    [121, '文件不存在'], 
    [122, '文件已存在'], 
    [123, '磁盘空间不足'], 
    
    [130,  'FTP已经绑定'], 
    [131,  'FTP已经绑定'], 
    [132,  'FTP已经打开连接'], 
    [133,  'FTP连接未打开'], 
    [134,  'FTP有任务正在进行'], 
    [135,  'FTP文件不可用'], 
    [136,  'FTP传输被中断'], 
    [137,  'FTP其他临时性错误'], 
    [138,  'FTP其他永久性错误']
];

register_enum('error', '错误码', error_string);
